## Pandas

### 1. Pandas DataFrame and Operations

In [3]:
# pandas 라이브러리를 불러옵니다. pd를 약칭으로 사용합니다.
!pip install pandas

Requirement already satisfied: pandas in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (1.4.3)
Requirement already satisfied: numpy>=1.18.5 in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (from pandas) (1.23.2)
Requirement already satisfied: pytz>=2020.1 in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (from pandas) (2022.2.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [4]:
# import numpy ad np
# import pandas as pd
# import matplotlib.pyplt as plt
# import seaborn as sns

import pandas as pd
pd.__version__

'1.4.2'

- DataFrame은 2차원 테이블이고, 테이블의 한 줄(행/열)을 Series라고 합니다.


- Series의 모임이 곧, DataFrame이 됩니다.

In [7]:
# s는 1, 3, 5, 6, 8을 원소로 가지는 pandas.Series
pd.Series([1, 3, 5, 6, 8]) # 대문자 S! , 리스트와 비슷하다고 이해하자

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [9]:
# 6x4 행렬에 1부터 24까지의 숫자를 원소를 가지고, columns은 순서대로 X1, X2, X3, X4로 하는 DataFrame 생성, 판다스의 근본 데이터프레임!
df = pd.DataFrame(data=[[1, 2, 3, 4],
                        [5, 6, 7, 8],
                        [9, 10, 11, 12],
                        [13, 14, 15, 16],
                        [17, 18, 19, 20],
                        [21, 22, 23, 24]],
                  columns=["X1", "X2", "X3", "X4"])
df

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

In [10]:
# dataframe index
df.index

RangeIndex(start=0, stop=6, step=1)

In [11]:
# dataframe columns
df.columns

Index(['X1', 'X2', 'X3', 'X4'], dtype='object')

In [12]:
# dataframe values
df.values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20],
       [21, 22, 23, 24]])

In [18]:
# 특정 column을 가져오기
df["X1"] # pd.series

0     1
1     5
2     9
3    13
4    17
5    21
Name: X1, dtype: int64

In [21]:
# X1 column에 2 더하기
df["X1"] + 2 # broadcasting 가능!, 문자열이라면 문자열 concat도 가능!

0     3
1     7
2    11
3    15
4    19
5    23
Name: X1, dtype: int64

### 2.1. Dataframe 기초 method

In [23]:
# dataframe의 맨 위 다섯줄을 보여주는 head()
df.head(3) # 위에서부터 세 줄 출력!

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12

In [24]:
# 10줄
df.head(10)

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

In [25]:
# 자매품으로 밑에서부터 보는 tail!
df.tail(2)

   X1  X2  X3  X4
4  17  18  19  20
5  21  22  23  24

In [29]:
# dataframe에 대한 전체적인 요약정보를 보여줍니다. index, columns, null/not-null/dtype/memory usage가 표시됩니다.
df.info()
# NULL > 컴퓨터의 '없음' 표시
# non-null: 없지 않음, 해당 데이터에 비어있지 않는 데이터의 수, 빈 칸이 몇개나 있는지에대한 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      6 non-null      int64
 1   X2      6 non-null      int64
 2   X3      6 non-null      int64
 3   X4      6 non-null      int64
dtypes: int64(4)
memory usage: 320.0 bytes

In [30]:
# dataframe에 대한 전체적인 통계정보를 보여줍니다.
df.describe()

              X1         X2         X3         X4
count   6.000000   6.000000   6.000000   6.000000
mean   11.000000  12.000000  13.000000  14.000000
std     7.483315   7.483315   7.483315   7.483315
min     1.000000   2.000000   3.000000   4.000000
25%     6.000000   7.000000   8.000000   9.000000
50%    11.000000  12.000000  13.000000  14.000000
75%    16.000000  17.000000  18.000000  19.000000
max    21.000000  22.000000  23.000000  24.000000

In [33]:
# X2 column를 기준으로 내림차순 정렬
# df.sort_values(by="X2") # 특정 컬럼을 기준으로 정렬
df.sort_values(by="X2", ascending=False) # 오름차순으로 정렬

   X1  X2  X3  X4
5  21  22  23  24
4  17  18  19  20
3  13  14  15  16
2   9  10  11  12
1   5   6   7   8
0   1   2   3   4

In [36]:
df.loc[2, 'X2'] = 10
df

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

### 2.2. Fancy Indexing ! (***)

- 데이터를 filtering <=> Search !

- 전체 데이터에서 원하는 일부의 데이터를 찾아오는 방법 !

In [ ]:
# pandas dataframe은 column 이름을 이용하여 기본적인 Indexing이 가능합니다.

In [ ]:
# dataframe에서 slicing을 이용하면 row 단위로 잘려나옵니다.

In [ ]:
# df.loc에 2차원 indexing도 가능합니다.
## df.loc[index, column_name]
df.loc[7, "X1"]  # index값이 7이고, column 이름이 'X1'인 데이터.

In [ ]:
# dataframe에 조건식을 적용해주면 조건에 만족하는지 여부를 알려주는 "mask"가 생깁니다.

In [ ]:
# iloc로 2차원 indexing을 하게되면, row 기준으로 index 3,4를 가져오고 column 기준으로 0, 1을 가져옵니다.

In [ ]:
# Q. 2차원 indexing에 뒤에가 : 면 어떤 의미일까요?

### 2.3 DataFrame으로 데이터 불러오기

In [6]:
!pip install seaborn

Requirement already satisfied: seaborn in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (0.11.2)
Requirement already satisfied: numpy>=1.15 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from seaborn) (1.21.5)
Requirement already satisfied: scipy>=1.0 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from seaborn) (1.7.3)
Requirement already satisfied: matplotlib>=2.2 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from seaborn) (3.5.1)
Requirement already satisfied: pandas>=0.23 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from seaborn) (1.4.2)
Requirement already satisfied: python-dateutil>=2.7 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (2.8.2)
Requirement already satisfied: cycler>=0.10 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (0.11.0)
Requirement already satisfied: packaging>=20.0 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (21.3)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (1.3.2)
Requirement already satisfied: pillow>=6.2.0 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (9.0.1)
Requirement already satisfied: pyparsing>=2.2.1 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (3.0.4)
Requirement already satisfied: fonttools>=4.22.0 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from matplotlib>=2.2->seaborn) (4.25.0)
Requirement already satisfied: pytz>=2020.1 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from pandas>=0.23->seaborn) (2021.3)
Requirement already satisfied: six>=1.5 in /Users/sainthm/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.16.0)

In [ ]:
# import matplotlib.pyplot as plt
# import

In [11]:
# csv 파일 불러오기
data = pd.read_csv('data/kospi2022.csv') # 엄청 나게 자주 쓸 함수



# Q. 올해 코스피가 2000 이하로 떨어진 날이 언제일까?
data[data["price"] <= 2500]  # boolean mask

           date    price
108  2022-06-14  2492.97
109  2022-06-15  2447.38
110  2022-06-16  2451.41
111  2022-06-17  2440.93
112  2022-06-20  2391.03
113  2022-06-21  2408.93
114  2022-06-22  2342.81
115  2022-06-23  2314.32
116  2022-06-24  2366.60
117  2022-06-27  2401.92
118  2022-06-28  2422.09
119  2022-06-29  2377.99
120  2022-06-30  2332.64
121  2022-07-01  2305.42
122  2022-07-04  2300.34
123  2022-07-05  2341.78
124  2022-07-06  2292.01
125  2022-07-07  2334.27
126  2022-07-08  2350.61
127  2022-07-11  2340.27
128  2022-07-12  2317.76
129  2022-07-13  2328.61
130  2022-07-14  2322.32
131  2022-07-15  2330.98
132  2022-07-18  2375.25
133  2022-07-19  2370.97
134  2022-07-20  2386.85
135  2022-07-21  2409.16
136  2022-07-22  2393.14
137  2022-07-25  2403.69
138  2022-07-26  2412.96
139  2022-07-27  2415.53
140  2022-07-28  2435.27
141  2022-07-29  2451.50
142  2022-08-01  2452.25
143  2022-08-02  2439.62
144  2022-08-03  2461.45
145  2022-08-04  2473.11
146  2022-08-05  2490.80
147  2022-08-08  2493.10
149  2022-08-10  2480.88
155  2022-08-19  2492.69
156  2022-08-22  2462.50
157  2022-08-23  2435.34
158  2022-08-24  2447.45
159  2022-08-25  2477.26
160  2022-08-26  2481.03
161  2022-08-29  2426.89
162  2022-08-30  2450.93
163  2022-08-31  2472.05
164  2022-09-01  2415.61
165  2022-09-02  2409.41

In [16]:
# data["date"]

# Q2. kospi2022.csv 파일에서 2022-6월 이전의 데이터만 볼 수 있을까?
data[data["date"] < "2022-06-01"]

           date    price
0    2022-01-03  2988.77
1    2022-01-04  2989.24
2    2022-01-05  2953.97
3    2022-01-06  2920.53
4    2022-01-07  2954.89
..          ...      ...
96   2022-05-25  2617.22
97   2022-05-26  2612.45
98   2022-05-27  2638.05
99   2022-05-30  2669.66
100  2022-05-31  2685.90

[101 rows x 2 columns]

In [19]:
# 엑셀 파일 불러오기
data = pd.read_excel('data/2020_02_거래내역.xls')

data

,이용일시,승인번호,본인구분,브랜드,이용카드,가맹점명,이용금액,이용구분,매입상태,카테고리
0,2020/02/28 12:14,14073061,본,비자,706,쿠팡,2900,일시불,전표매입,쇼핑
1,2020/02/27 08:41,3311645,본,비자,706,(주) 에이스타커피컴퍼니,5100,일시불,전표매입,커피
2,2020/02/26 22:35,1777639,본,비자,706,(주)우아한형제들,17400,일시불(A),전표매입,야식
3,2020/02/25 18:48,40090458,본,비자,706,하노이별 서강대점,8000,일시불,전표매입,식비
4,2020/02/25 10:02,33240961,본,비자,706,(주) 에이스타커피컴퍼니,5100,일시불,전표매입,커피
...,...,...,...,...,...,...,...,...,...,...
56,2020/02/02 14:06,6544316,본,비자,706,에어프랑스한국지점-BSP,991100,03개월,전표매입,여행
57,2020/02/01 22:21,2751583,본,비자,706,씨유 서강대학사점,3500,일시불,전표매입,식비
58,2020/02/01 18:57,905431,본,비자,706,스타벅스커피코리아,50000,일시불,전표매입,커피
59,2020/02/01 18:44,773794,본,비자,706,개미집,22000,일시불,전표매입,식비
60,2020/02/01 11:04,45363052,본,비자,706,대학약국,6000,일시불,전표매입,생필품